CSI API ETABS v1
cAreaElm.GetNameList Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameList(
	ref int NumberNames,
	ref string[] MyName
)
Function GetNameList (
	ByRef NumberNames As Integer,
	ByRef MyName As String()
) As Integer
Dim instance As cAreaElm
Dim NumberNames As Integer
Dim MyName As String()
Dim returnValue As Integer
returnValue = instance.GetNameList(NumberNames,
	MyName)
int GetNameList(
	int% NumberNames,
	array<String^>^% MyName
)
abstract GetNameList :
        NumberNames : int byref *
        MyName : string[] byref -> int
Parameters
NumberNames
Type: System.Int32
MyName
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cAreaElm Interface
ETABSv1 Namespace